# 5.1 판다스 자료구조 소개

In [11]:
import numpy as np
import pandas as pd

## Series

일련의 객체를 담을 수 있는 1차원 배열 같은 자료구조

Index 배열의 데이터와 연관된 이름을 갖는다

In [12]:
obj = pd.Series([4,7,-5,3])
obj
# 좌측에는 index, 우측에는 index값

0    4
1    7
2   -5
3    3
dtype: int64

In [13]:
obj.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [14]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [15]:
# 각 데이터를 지칭하는 index 지정
obj2 = pd.Series([1,2,3,4],index = ['a','b','c','d'])
obj2

a    1
b    2
c    3
d    4
dtype: int64

In [16]:
# index로 레이블을 사용하여 단일 또는 여러 값 선택
obj2['c']

3

In [17]:
obj2[['a','d','c']]

a    1
d    4
c    3
dtype: int64

boolean 배열을 이용하여 값을 걸러내거나, 스칼라 곱셈, 수학 함수 적용 등 numpy 배열 연산을 수행해도 index와 값의 연결은 유지됨

In [18]:
obj2[obj2 > 2]

c    3
d    4
dtype: int64

In [19]:
obj2 * 2

a    2
b    4
c    6
d    8
dtype: int64

In [20]:
np.exp(obj2)

a     2.718282
b     7.389056
c    20.085537
d    54.598150
dtype: float64

In [21]:
# Series는 index 값에 데이터가 mapping되고 있으므로 파이썬 dictionary와 유사
'b' in obj2

True

In [22]:
'e' in obj2

False

python dictionary 객체로부터 Series 객체를 생성할 수 있음

In [23]:
pdata = {"Ohio": 3500, "Texas": 7000, "Oregon": 1600, "Utah": 5000} # python dictionary 객체

obj3 = pd.Series(pdata) # Series 객체 생성

obj3

Ohio      3500
Texas     7000
Oregon    1600
Utah      5000
dtype: int64

In [24]:
# 역으로 Series -> python dictionary 변환 가능 (to_dict)
obj3.to_dict()

{'Ohio': 3500, 'Texas': 7000, 'Oregon': 1600, 'Utah': 5000}

In [25]:
# index값을 지정하고 순서를 정할 수 있다
states = ["Callifornia","Ohio","Oregon","Texas"]

obj4 = pd.Series(pdata,index = states)
obj4 # Callifornia는 pdata에 없는 데이터이기 때문에 NaN으로 표기

Callifornia       NaN
Ohio           3500.0
Oregon         1600.0
Texas          7000.0
dtype: float64

In [26]:
# 누락된 데이터는 NA, null로 표기됨
# 누락된 데이터를 찾을 때는 pandas의 isnull, notnull 함수 이용
pd.isna(obj4)

Callifornia     True
Ohio           False
Oregon         False
Texas          False
dtype: bool

In [27]:
pd.notna(obj4)

Callifornia    False
Ohio            True
Oregon          True
Texas           True
dtype: bool

In [28]:
obj4.isna() # Series의 인스턴스 메서드

Callifornia     True
Ohio           False
Oregon         False
Texas          False
dtype: bool

Series의 유용한 기능은 산술 연산에서 index와 label로 자동 정렬하는 기능

In [29]:
obj3

Ohio      3500
Texas     7000
Oregon    1600
Utah      5000
dtype: int64

In [30]:
obj4

Callifornia       NaN
Ohio           3500.0
Oregon         1600.0
Texas          7000.0
dtype: float64

In [31]:
obj3 + obj4

Callifornia        NaN
Ohio            7000.0
Oregon          3200.0
Texas          14000.0
Utah               NaN
dtype: float64

Series 객체와 index는 모두 name 속성을 가진다

In [32]:
obj4.name = "population"

obj4.index.name = "state"

obj4

state
Callifornia       NaN
Ohio           3500.0
Oregon         1600.0
Texas          7000.0
Name: population, dtype: float64

In [33]:
# 대입으로 Series의 index를 변경할 수 있다
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [34]:
obj.index = ["Kim","Lee","Park","Kang"]
obj

Kim     4
Lee     7
Park   -5
Kang    3
dtype: int64

## DataFrame

DataFrame은 행과 열에 대한 index를 가지며, 표 같은 스프레드시트 형식의 자료구조

In [35]:
import pandas as pd
import numpy as np

In [36]:
data = {"state":["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"],
        "year":[2000, 2001, 2002, 2001, 2002, 2003],
        "pop":[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [37]:
frame # data의 key순서에 따라 정렬되어 저장된다

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [38]:
# DataFrame이 클 경우 head 메서드를 이용해 처음 5개의 행만 출력할 수 있다
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [39]:
# 마지막 5개의 행만 출력할 수도 있다
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [40]:
# columns을 원하는 순서대로 지정하면 해당 순서로 정렬된 DataFrame 객체가 생성된다
pd.DataFrame(data,columns=["year","pop","state"])

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [41]:
# dictionary에 없는 값을 columns에 넘기면 결측치(missing value)가 표시된다
frame2 = pd.DataFrame(data,columns=["year","state","pop","debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [42]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [43]:
# Series처럼 dictionary 형식의 표기법 또는 점 표기법으로 접근 가능
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [44]:
frame2.year
# raw 이름에 공백이나 밑줄이 아닌 기호가 포함된 경우에는 점 표기법을 사용할 수 없다

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [45]:
# 대입을 통해 열 수정
frame2["debt"] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [46]:
frame2["debt"] = np.arange(6.0)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [47]:
# 리스트나 배열을 열에 대입할 경우 대입하려는 값의 길이가 DataFrame의 길이와 동일해야 한다
# Series를 대입하면 DataFrame의 index에 따라 값이 대입되며 존재하지 않는 index에는 결측치가 대입된다
val = pd.Series([-1.2, -1.5, -1.7],index = ["two","three","four"])
frame2["debt"] = val
frame2
# 존재하지 않는 index에 결측치가 대입되었다

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [48]:
# 존재하지 않는 열을 대입할 경우 새로운 열이 생성
frame2["eastern"] = frame2["state"] == "Ohio"
# boolean 값으로 출력
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [49]:
# 열을 삭제할 경우 del 예약어 사용
del frame2["eastern"]
frame2.columns # "eastern"열 삭제

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [50]:
# 중첩된 dictionary를 이용하여 데이터를 생성할 수 있다
population = {"Ohio":{2000 : 1.5, 2001 : 1.7, 2002 : 3.6}, "Nevada":{2001 : 2.4, 2002 : 2.9}}
frame3 = pd.DataFrame(population)
# 바깥에 있는 key가 열이 되고 내부에 있는 key가 행이 된다
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [51]:
# 데이터 전치(축 뒤집기)
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [52]:
# index를 직접 지정할 경우 지정된 index로 DataFrame 생성
pd.DataFrame(population,index= [2001,2002,2003])
# population dictionary에는 2003이라는 key가 없기 때문에 결측치로 출력

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [53]:
# series 객체를 담고 있는 dictionary 데이터도 동일한 방식으로 취급
pdata = {"Ohio":frame3["Ohio"][:-1],"Nevada":frame3["Nevada"][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [54]:
# index와 columns에 name속성 설정
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [55]:
# DataFrame에는 series와 달리 name속성이 없음
# to_numpy 메서드는 데이터를 2차원 형태의 ndarray로 반환
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [56]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

## index 객체

In [62]:
obj = pd.Series(np.arange(3), index = ["a","b","c"])
obj

a    0
b    1
c    2
dtype: int32

In [63]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [58]:
index[1:]

Index(['b', 'c'], dtype='object')

In [60]:
# index 객체는 변경이 불가
# index[1] = "d"

index 객체의 불변성 덕분에 자료구조 사이에서 index를 안전하게 공유할 수 있다

In [64]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [65]:
obj2 = pd.Series([1.5,-2.5,0],index = labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [66]:
obj2.index is labels

True

In [67]:
# 배열과 유사하게 index객체도 고정된 크기로 작동
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [68]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [69]:
2003 in frame3.index

False

In [70]:
# python 집합과는 달리 pandas의 index는 중복되는 값을 허용
pd.Index(["foo","foo","bar","bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

유용한 index 메서드

append() : 추가적인 index객체를 덧붙여 새로운 index 반환

difference() : index의 차집합 반환

intersection() : index의 교집합 반환

union() : index의 합집합 반환

isin() : index가 넘겨받은 index에 존재하는지 알려주는 불리언 배열 반환

delete() : i 위치의 index가 삭제된 새로운 index 반환

insert() : i 위치에 index가 추가된 새로운 index 반환

drop() : 넘겨받은 값이 삭제된 새로운 index 반환

unique() : index에서 중복되는 요소를 제거하고 유일한 값만 반환

is_unique() : 중복되는 index가 없다면 true 반환